{
   "allow_add_mods" : true,
   "custom_icons" : false,
   "description" : "THIS WAS RENAMED\r\noriginal name: \"Quick Logic 3.0\"\r\n(also new picture)\r\n\r\n\r\nThis is a Mod with tools and parts for [b]vanilla logic.[/b]\r\n\r\nIt now comes with new parts like the [b]Quick Logic Gates[/b] that are not only [b]thousands of times faster[/b] than regular Logic Gates but also open a whole new world of possibilities.\r\n[img]https://imgur.com/U84MvTJ.png[/img]\r\n[hr][/hr]\r\n[list]\r\n[*][b]Connection Copy/Paste[/b]\r\nWith this tool you can copy connection from one part to another! This can be used to move connections to another block, or simply to make it easier to have many parts with the same connections. (more details in the part's in-game description, or see screenshots & videos)\r\n\r\n[*][b]Parallel Connections[/b]\r\nThis tool automatically adds remaining connections when you make lots in parallel. Simply paint the 2 rows of logic parts in the marker colors, make the 1st connection, and the tool will make the rest. (more details in the part's in-game description, or see screenshots & videos)\r\n[img]https://imgur.com/06CcnW7.gif[/img]\r\n\r\n[*][b]Connection Maker (by Color)[/b]\r\nMakes connections between groups of 2 colors, for example connect all green parts to all blue parts. Simply paint the parts in groups and apply the tool. (more details in the part's in-game description, or see screenshots & videos)\r\n[img]https://imgur.com/TGn5sOl.gif[/img]\r\n[/list]\r\n\r\nFind more Logic Tools below in the \"Beta Content\" section!\r\n\r\n\r\n[img]https://imgur.com/Thi0IdC.png[/img]\r\n[hr][/hr]\r\nFaster tickspeed, faster logic. Switch to quick logic and speed up your old creations by converting them with the Multitool! (see \"Logic Multitool\" section to learn more)\r\n[list]\r\n[*][b]Quick Logic Gate[/b]\r\nWorks just like a normal Logic Gate, but can be [b]much[/b] faster! (Adjust the Speed Factor to control the speed)\r\n\r\n[*][b]Quick Timer[/b]\r\nWorks just like a normal Timer, but can be much faster! (Adjust the Speed Factor to control the speed)\r\n\r\n[*][b]RAM Block[/b]\r\nThis part has (almost) unlimited memory at full Quick Logic speed and takes only a few blocks to setup. Using the Interface Blocks you can build an interface to interact with the RAM Block (see screenshots & videos). Because of the interface it is considered a \"Special Block\".\r\n\r\n[*][b]Interface Block[/b]\r\nWith this block you make interfaces for Special Blocks. The size and color of the interfaces are important for the different inputs and outputs of the Special Block. For now it is only used with the RAM Block.\r\n\r\n[*][b]Single Step Button[/b]\r\nWith this button you can simulate all Quick Logic tick by tick. The logic parts basically work in slow motion, which makes it easier to analyze circuits. Pressing the button simulates the next tick.\r\n[/list]\r\n\r\n[h1]Speed Factor[/h1]\r\nThe speed factor sets the speed of the quick logic parts. \"1x\" is the equivalent to vanilla logic speed, \"2x\" would double the speed.\r\n[img]https://imgur.com/EO8JkPf.gif[/img]\r\n[img]https://imgur.com/kT8R43x.gif[/img]\r\nThe speed factor is only limited by the performance of your PC.\r\n\r\n[b]An awesome example of the power of the speed factor is this software TETRIS game by PrincH2A that runs on a [u]logic gate CPU[/u]![/b]\r\n[quote][h1][b][url=https://steamcommunity.com/sharedfiles/filedetails/?id=2859142179]Software TETRIS [img]https://imgur.com/Qgmsd9S.png[/img][/url][/b][/h1][/quote]\r\n\r\n\r\n[img]https://imgur.com/c1Ps7nv.png[/img]\r\n[hr][/hr]\r\n\r\n[h1]Logic Converter (Tool 1/2)[/h1]\r\nEasy transition to Quick Logic by converting your old circuits! Just point and Left/Right click to convert back and forth between Quick Logic and Vanilla Logic.\r\n[img]https://imgur.com/yPDeCx4.png[/img]\r\n(Left click -> Quick Logic, Right click -> Vanilla Logic)\r\n\r\n[h1]Advanced Tool Functions (Tool 2/2)[/h1]\r\nAdds new features to the connect and paint tool such as extra information or extra functionality.\r\n[img]https://imgur.com/dPKa0rD.png[/img]\r\n[img]https://imgur.com/B6eQTyD.png[/img]\r\n[img]https://imgur.com/37FkOLX.png[/img]\r\n\r\nThe Logic Multitool will receive more functions in the future.\r\n\r\n[img]https://imgur.com/wloCvdT.png[/img]\r\n[hr][/hr]\r\n[b]WIP features: (not guaranteed, just ideas that I'm making and testing)[/b]\r\n-Colored connections?? ;D\r\n-Logic Gate Mode Changer\r\n-Parallel Connection Copy/Paste (in Beta)\r\n-Parallel Logic Merger (in Beta)\r\n-Paint & Wire Memory (in Beta)\r\n-Color Connection Remover (in Beta)\r\n-Relative Color Connection Maker (in Beta)\r\n-More Special Blocks (Display, IC, Sensor & more)\r\n\r\nThe Beta is experimental, but has more frequent updates and lots of exciting new stuff!\r\n[quote][h1][url=https://steamcommunity.com/sharedfiles/filedetails/?id=2608898394]BETA LINK[/url][/h1][/quote]\r\n\r\n\r\nIf you encount any bugs or issues, or if you have any suggestions, feel free to leave a comment!",
   "fileId" : 2817316401,
   "localId" : "238d300b-aa4a-43f7-98ea-2d67845f2596",
   "name" : "(Early Access) Vincling's Logic Tools & Parts Mod",
   "type" : "Blocks and Parts",
   "version" : 1
}
